In [1]:
word = 'Layla'

In [2]:
sent = 'Layla is cute'

In [3]:
word[0]

'L'

In [4]:
sent[0]

'L'

In [6]:
sent[0:5]

'Layla'

In [7]:
sent[ : ]

'Layla is cute'

In [8]:
sent[:len(word)]

'Layla'

In [9]:
text = 'The Layla is cute, because she was cute'

In [10]:
text

'The Layla is cute, because she was cute'

In [11]:
text[:len(text)]

'The Layla is cute, because she was cute'

In [12]:
sent[-7:-3]

'is c'

In [13]:
'{0:4.6} output'.format(7/67890)

'0.000103108 output'

In [15]:
sent[-3:]

'ute'

In [16]:
sent

'Layla is cute'

In [17]:
word[:3]

'Lay'

In [18]:
word[0:3]

'Lay'

In [19]:
sent[4:]

'a is cute'

In [20]:
sent[:]

'Layla is cute'

In [21]:
sent[::2]

'Lyai ue'

In [22]:
a = 'Name : Layla'
b = 'StudentID : 20231111'
c = 'Hobby : Study'
d = 'Comment : cute'

In [24]:
" ".join([a, b, c, d])

'Name : Layla StudentID : 20231111 Hobby : Study Comment : cute'

In [25]:
strs = """Guard: What? Ridden en a horse?
Queen Raiden: Yes!
Guard: You're using coconuts!
Queen Raiden: What?
Guard: You're Got ... coconute[s] and you're banagin em togther
"""

In [27]:
strs

"Guard: What? Ridden en a horse?\nQueen Raiden: Yes!\nGuard: You're using coconuts!\nQueen Raiden: What?\nGuard: You're Got ... coconute[s] and you're banagin em togther\n"

In [28]:
strs.splitlines()[::2]

['Guard: What? Ridden en a horse?',
 "Guard: You're using coconuts!",
 "Guard: You're Got ... coconute[s] and you're banagin em togther"]

In [29]:
strs.replace('Guard', "Yae Miko").splitlines()[::2]

['Yae Miko: What? Ridden en a horse?',
 "Yae Miko: You're using coconuts!",
 "Yae Miko: You're Got ... coconute[s] and you're banagin em togther"]

In [30]:
'{} is very cute!'.format('Layla')

'Layla is very cute!'

In [31]:
"""{0}은 매우매우 착하고 귀엽고 사랑스럽습니다.
이 사악한 {1}은 {0}을 괴롭히는 원인 중 하나입니다.
""".format("레일라","나히다")

'레일라은 매우매우 착하고 귀엽고 사랑스럽습니다.\n이 사악한 나히다은 레일라을 괴롭히는 원인 중 하나입니다.\n'

In [32]:
'나히다는 {age} 살 이상이다.'.format(age = 500)

'나히다는 500 살 이상이다.'

In [33]:
'나의 통장 잔고가 {:,}달러면 좋겠다'.format(909999999999999999999999999999999999)

'나의 통장 잔고가 909,999,999,999,999,999,999,999,999,999,999,999달러면 좋겠다'

In [34]:
'output1 : {0:.3}\n output2 : {0:.3%}'.format(7/67890)

'output1 : 0.000103\n output2 : 0.010%'

In [35]:
'My id code is {0:06d}'.format(12)

'My id code is 000012'

In [36]:
'My love number is %d' % 10

'My love number is 10'

In [38]:
'%(name)s 는 매우 매우 귀엽고 사랑스럽지만, 그녀의 수면 시간은 고작 %(time).2f 시간 이다.' % ({'name' : 'Layla', 'time' : 1.1631212})

'Layla 는 매우 매우 귀엽고 사랑스럽지만, 그녀의 수면 시간은 고작 1.16 시간 이다.'

In [40]:
name = "레일라"
f'{name}! 12/19 생일 축하해!'

'레일라! 12/19 생일 축하해!'

In [41]:
import datetime

In [42]:
print(f"t1 : {datetime.datetime.now()}")
print(f"t2 : {datetime.datetime(1970, 1,1)}")
print(f"t3 : {datetime.datetime(1970, 12, 12, 13, 24, 34)}")

t1 : 2023-12-17 15:20:48.820107
t2 : 1970-01-01 00:00:00
t3 : 1970-12-12 13:24:34

In [43]:
import re

In [49]:
ax  = re.match(pattern='\d{10}', string = '1234567890')
ax

In [46]:
print("match" if bool(ax) else "Unmatch")

match

In [47]:
ax  = re.match(pattern='\d{10}\s', string = '1234567890')
ax

In [48]:
print("match" if bool(ax) else "Unmatch")

Unmatch

In [50]:
print("match" if bool(ax) else "Unmatch")

match

In [52]:
ax.start()
ax.end()
ax.span()

(0, 10)

In [53]:
ax.start()

0

In [54]:
ax.end()

10

In [55]:
ax.span()

(0, 10)

In [58]:
ax.group()

'1234567890'

In [59]:
re.match(pattern='\d{3}\s\d{4}\s\d{4}', string = '123 4567 8901')

In [60]:
re.match(pattern='\(\d{3}\)\s\d{3}\-\d{4}', string = '(123) 456-7890')

In [61]:
re.match(pattern='\+\d\s\(\d{3}\)\s\d{3}\-\d{4}', string = '+1 (123) 456-7890')

In [63]:
p = re.compile('\D{9}\:\d{4}')
p.match('LocalHost:8888')

In [64]:
my_exp = lambda x : x ** 2
my_exp_c = lambda x, n : x ** n

In [65]:
import pandas as pd

In [66]:
df = pd.DataFrame({
    'a' : [10, 20, 30],
    'b' : [20, 30, 40]
})

In [67]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [68]:
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [69]:
df['a'].apply(my_exp)

0    100
1    400
2    900
Name: a, dtype: int64

In [70]:
df['a'] ** 10

0        10000000000
1     10240000000000
2    590490000000000
Name: a, dtype: int64

In [71]:
df['a'].apply(my_exp_c, n = 10)

0        10000000000
1     10240000000000
2    590490000000000
Name: a, dtype: int64

In [72]:
printme = lambda x : print(x)

In [73]:
printme

In [74]:
df.apply(printme)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [76]:
# 반전효과, 행(0), 열(1) 반전 행(1) 열(0)
df.apply(printme, axis = 1)

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [77]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [78]:
def mymean(x):
    sum = 0
    for i in x:
        sum += i
    return sum / len(x)

In [81]:
import numpy as np

In [79]:
df.apply(mymean)

a    20.0
b    30.0
dtype: float64

In [80]:
df.apply(mymean, axis = 1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [82]:
df.apply(np.mean)

a    20.0
b    30.0
dtype: float64

In [83]:
df.apply(np.mean, axis = 1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [84]:
import seaborn as sns

In [85]:
df = sns.load_dataset("titanic")

In [86]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [87]:
df['missing'] = df.apply(lambda x : pd.isnull(x).sum(), axis = 1)

In [88]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,1

In [89]:
getNAN = lambda x : pd.isnull(x).sum()

In [90]:
df.apply(getNAN)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
missing          0
dtype: int64

In [91]:
getnan = lambda x : (pd.isnull(x).sum() / x.size)

In [93]:
a = df.apply(getnan)

In [94]:
a

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
missing        0.000000
dtype: float64

In [95]:
getnan2 = lambda x : (pd.isnull(x).sum() / x.size) * 100

In [97]:
a = df.apply(getnan2)
a

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
missing         0.000000
dtype: float64

In [98]:
nonnan = lambda x : 1 - (pd.isnull(x).sum() / x.size)

In [99]:
df.apply(nonnan)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
missing        1.000000
dtype: float64

In [100]:
nonnan2 = lambda x : ( 1 - (pd.isnull(x).sum() / x.size)) * 100

In [105]:
b = df.apply(nonnan2)
b

survived       100.000000
pclass         100.000000
sex            100.000000
age             80.134680
sibsp          100.000000
parch          100.000000
fare           100.000000
embarked        99.775533
class          100.000000
who            100.000000
adult_male     100.000000
deck            22.783389
embark_town     99.775533
alive          100.000000
alone          100.000000
missing        100.000000
dtype: float64

In [104]:
a

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
missing         0.000000
dtype: float64

In [106]:
b

survived       100.000000
pclass         100.000000
sex            100.000000
age             80.134680
sibsp          100.000000
parch          100.000000
fare           100.000000
embarked        99.775533
class          100.000000
who            100.000000
adult_male     100.000000
deck            22.783389
embark_town     99.775533
alive          100.000000
alone          100.000000
missing        100.000000
dtype: float64

In [107]:
a + b

survived       100.0
pclass         100.0
sex            100.0
age            100.0
sibsp          100.0
parch          100.0
fare           100.0
embarked       100.0
class          100.0
who            100.0
adult_male     100.0
deck           100.0
embark_town    100.0
alive          100.0
alone          100.0
missing        100.0
dtype: float64

In [108]:
df['missing2'] = df.apply(lambda x : pd.isnull(x).sum(), axis = 1)

In [109]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing,missing2
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1,1
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0,0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2,2
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,0,0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,1,1

In [110]:
df[['missing','missing2']]

     missing  missing2
0          1         1
1          0         0
2          1         1
3          0         0
4          1         1
..       ...       ...
886        1         1
887        0         0
888        2         2
889        0         0
890        1         1

[891 rows x 2 columns]

In [112]:
df[df['missing'] >= 2].sample(100)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing,missing2
240,0,3,female,NaN,1,0,14.4542,C,Third,woman,False,NaN,Cherbourg,no,False,2,2
388,0,3,male,NaN,0,0,7.7292,Q,Third,man,True,NaN,Queenstown,no,True,2,2
773,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True,2,2
538,0,3,male,NaN,0,0,14.5000,S,Third,man,True,NaN,Southampton,no,True,2,2
680,0,3,female,NaN,0,0,8.1375,Q,Third,woman,False,NaN,Queenstown,no,True,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
573,1,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True,2,2
732,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True,2,2
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2,2
793,0,1,male,NaN,0,0,30.6958,C,First,man,True,NaN,Cherbourg,no,True,2,2
126,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2,2

In [113]:
df = pd.read_csv('../data/gapminder.tsv', sep = '\t')

In [114]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [115]:
df.groupby('year').lifeExp.mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [116]:
df['year'].unique()

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

In [117]:
print(df['year'].unique())

[1952 1957 1962 1967 1972 1977 1982 1987 1992 1997 2002 2007]

In [119]:
y1952 = df[df['year'] == 1952]['lifeExp'].mean()
y1957 = df[df['year'] == 1957]['lifeExp'].mean()
y1962 = df[df['year'] == 1962]['lifeExp'].mean()
y2007 = df[df['year'] == 2007]['lifeExp'].mean()

In [120]:
y1952

49.057619718309866

In [121]:
y1957

51.50740112676056

In [122]:
y1962

53.609249014084504

In [123]:
y2007

67.00742253521126

In [124]:
df = pd.DataFrame({
    'year' : [1952, 1957, 1962, 2007],
    '' : [y1952, y1957, y1962, y2007]
})

In [125]:
df

   year
0  1952  49.057620
1  1957  51.507401
2  1962  53.609249
3  2007  67.007423

In [126]:
def my_mean(x):
    sum = 0
    for i in x:
        sum += i
    return sum / len(x)

In [129]:
df

   year
0  1952  49.057620
1  1957  51.507401
2  1962  53.609249
3  2007  67.007423

In [131]:
df = pd.read_csv('../data/gapminder.tsv', sep = '\t')

In [132]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [133]:
df.groupby('year').lifeExp.apply(my_mean)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [134]:
df.groupby('year').lifeExp.mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [135]:
def diff_mean(x, n):
    sum = 0
    for i in x:
        sum += i
    return (sum / len(x)) - n

In [136]:
df.groupby('year').lifeExp.apply(diff_mean, n = df['lifeExp'].mean())

year
1952   -10.416820
1957    -7.967038
1962    -5.865190
1967    -3.796150
1972    -1.827053
1977     0.095718
1982     2.058758
1987     3.738173
1992     4.685899
1997     5.540237
2002     6.220483
2007     7.532983
Name: lifeExp, dtype: float64

In [137]:
df.groupby('year').lifeExp.agg(diff_mean, n = df['lifeExp'].mean())

year
1952   -10.416820
1957    -7.967038
1962    -5.865190
1967    -3.796150
1972    -1.827053
1977     0.095718
1982     2.058758
1987     3.738173
1992     4.685899
1997     5.540237
2002     6.220483
2007     7.532983
Name: lifeExp, dtype: float64

In [138]:
df.groupby('year').lifeExp.agg([np.count_nonzero, np.mean, np.std])

      count_nonzero       mean        std
year
1952            142  49.057620  12.225956
1957            142  51.507401  12.231286
1962            142  53.609249  12.097245
1967            142  55.678290  11.718858
1972            142  57.647386  11.381953
1977            142  59.570157  11.227229
1982            142  61.533197  10.770618
1987            142  63.212613  10.556285
1992            142  64.160338  11.227380
1997            142  65.014676  11.559439
2002            142  65.694923  12.279823
2007            142  67.007423  12.073021

In [139]:
df.groupby('year').agg({'lifeExp':'mean','pop':'median','gdpPercap':'median'})

        lifeExp         pop    gdpPercap
year
1952  49.057620   3943953.0  1968.528344
1957  51.507401   4282942.0  2173.220291
1962  53.609249   4686039.5  2335.439533
1967  55.678290   5170175.5  2678.334740
1972  57.647386   5877996.5  3339.129407
1977  59.570157   6404036.5  3798.609244
1982  61.533197   7007320.0  4216.228428
1987  63.212613   7774861.5  4280.300366
1992  64.160338   8688686.5  4386.085502
1997  65.014676   9735063.5  4781.825478
2002  65.694923  10372918.5  5319.804524
2007  67.007423  10517531.0  6124.371108

In [140]:
df.describe()

             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165876
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846988
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

In [141]:
z_score = lambda x : (x - x.mean()) / x.std()

In [142]:
df.groupby('year').lifeExp.apply(z_score)

C:\Users\starl\AppData\Local\Temp\ipykernel_11724\1577534287.py:1: FutureWarning: Not prepending group keys to the result index of transform-like apply. In the future, the group keys will be included in the index, regardless of whether the applied function returns a like-indexed object.
To preserve the previous behavior, use

	>>> .groupby(..., group_keys=False)

To adopt the future behavior and silence this warning, use

	>>> .groupby(..., group_keys=True)
  df.groupby('year').lifeExp.apply(z_score)

0      -1.656854
1      -1.731249
2      -1.786543
3      -1.848157
4      -1.894173
          ...
1699   -0.081621
1700   -0.336974
1701   -1.574962
1702   -2.093346
1703   -1.948180
Name: lifeExp, Length: 1704, dtype: float64

In [143]:
df.groupby('year').lifeExp.transform(z_score)

0      -1.656854
1      -1.731249
2      -1.786543
3      -1.848157
4      -1.894173
          ...
1699   -0.081621
1700   -0.336974
1701   -1.574962
1702   -2.093346
1703   -1.948180
Name: lifeExp, Length: 1704, dtype: float64

In [144]:
df = sns.load_dataset("tips").sample(10, random_state = 42)

In [145]:
df

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176       17.89  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [146]:
df.loc[np.random.permutation(df.index)[:4], 'total_bill'] = np.NAN

In [147]:
df

     total_bill   tip     sex smoker   day    time  size
24          NaN  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211         NaN  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176       17.89  2.00    Male    Yes   Sun  Dinner     2
192         NaN  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101         NaN  3.00  Female    Yes   Fri  Dinner     2

In [148]:
df.groupby('sex').count()

        total_bill  tip  smoker  day  time  size
sex
Male             4    7       7    7     7     7
Female           2    3       3    3     3     3

In [149]:
fill_score = lambda x : x.fillna(x.mean())

In [150]:
df.groupby('sex').total_bill.apply(fill_score)

C:\Users\starl\AppData\Local\Temp\ipykernel_11724\4276386548.py:1: FutureWarning: Not prepending group keys to the result index of transform-like apply. In the future, the group keys will be included in the index, regardless of whether the applied function returns a like-indexed object.
To preserve the previous behavior, use

	>>> .groupby(..., group_keys=False)

To adopt the future behavior and silence this warning, use

	>>> .groupby(..., group_keys=True)
  df.groupby('sex').total_bill.apply(fill_score)

24     16.4975
6       8.7700
153    24.5500
211    16.4975
198    13.0000
176    17.8900
192    16.4975
124    12.4800
9      14.7800
101    12.7400
Name: total_bill, dtype: float64

In [151]:
df['mean of sex'] = df.groupby('sex').total_bill.apply(fill_score)

C:\Users\starl\AppData\Local\Temp\ipykernel_11724\3113194662.py:1: FutureWarning: Not prepending group keys to the result index of transform-like apply. In the future, the group keys will be included in the index, regardless of whether the applied function returns a like-indexed object.
To preserve the previous behavior, use

	>>> .groupby(..., group_keys=False)

To adopt the future behavior and silence this warning, use

	>>> .groupby(..., group_keys=True)
  df['mean of sex'] = df.groupby('sex').total_bill.apply(fill_score)

In [152]:
df

     total_bill   tip     sex smoker   day    time  size  mean of sex
24          NaN  3.18    Male     No   Sat  Dinner     2      16.4975
6          8.77  2.00    Male     No   Sun  Dinner     2       8.7700
153       24.55  2.00    Male     No   Sun  Dinner     4      24.5500
211         NaN  5.16    Male    Yes   Sat  Dinner     4      16.4975
198       13.00  2.00  Female    Yes  Thur   Lunch     2      13.0000
176       17.89  2.00    Male    Yes   Sun  Dinner     2      17.8900
192         NaN  2.56    Male    Yes  Thur   Lunch     2      16.4975
124       12.48  2.52  Female     No  Thur   Lunch     2      12.4800
9         14.78  3.23    Male     No   Sun  Dinner     2      14.7800
101         NaN  3.00  Female    Yes   Fri  Dinner     2      12.7400

In [153]:
df = sns.load_dataset("tips")

In [154]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [155]:
df['size'].value_counts()

2    156
3     38
4     37
5      5
1      4
6      4
Name: size, dtype: int64

In [156]:
df.groupby('sex').mean().index

C:\Users\starl\AppData\Local\Temp\ipykernel_11724\1604353497.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('sex').mean().index

CategoricalIndex(['Male', 'Female'], categories=['Male', 'Female'], ordered=False, dtype='category', name='sex')

In [159]:
df.groupby('size').filter(lambda x : x['size'].count() >= 30)['size'].value_counts()

2    156
3     38
4     37
Name: size, dtype: int64

In [160]:
df = sns.load_dataset("tips").sample(10, random_state = 42)

In [161]:
df

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176       17.89  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [162]:
df.groupby('sex').count()

        total_bill  tip  smoker  day  time  size
sex
Male             7    7       7    7     7     7
Female           3    3       3    3     3     3

In [163]:
grouped = df.groupby('sex')

In [165]:
grouped.groups

{'Male': [24, 6, 153, 211, 176, 192, 9], 'Female': [198, 124, 101]}

In [166]:
grouped.mean()

C:\Users\starl\AppData\Local\Temp\ipykernel_11724\2755795945.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grouped.mean()

        total_bill       tip      size
sex
Male         20.02  2.875714  2.571429
Female       13.62  2.506667  2.000000

In [167]:
grouped.get_group('Female')

     total_bill   tip     sex smoker   day    time  size
198       13.00  2.00  Female    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [168]:
for i in grouped:
    print(i)

('Male',      total_bill   tip   sex smoker   day    time  size
24        19.82  3.18  Male     No   Sat  Dinner     2
6          8.77  2.00  Male     No   Sun  Dinner     2
153       24.55  2.00  Male     No   Sun  Dinner     4
211       25.89  5.16  Male    Yes   Sat  Dinner     4
176       17.89  2.00  Male    Yes   Sun  Dinner     2
192       28.44  2.56  Male    Yes  Thur   Lunch     2
9         14.78  3.23  Male     No   Sun  Dinner     2)
('Female',      total_bill   tip     sex smoker   day    time  size
198       13.00  2.00  Female    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2)

In [169]:
for i in grouped:
    print(f"타입 : {type(i)}")
    print(f"길이 : {len(i)}")
    print(f"이름 : {i[0]}")

타입 : <class 'tuple'>
길이 : 2
이름 : Male
타입 : <class 'tuple'>
길이 : 2
이름 : Female

In [170]:
grouped.mean().index

C:\Users\starl\AppData\Local\Temp\ipykernel_11724\1921085888.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grouped.mean().index

CategoricalIndex(['Male', 'Female'], categories=['Male', 'Female'], ordered=False, dtype='category', name='sex')

In [171]:
df.groupby(['sex','time']).mean().index

C:\Users\starl\AppData\Local\Temp\ipykernel_11724\3167386569.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['sex','time']).mean().index

MultiIndex([(  'Male',  'Lunch'),
            (  'Male', 'Dinner'),
            ('Female',  'Lunch'),
            ('Female', 'Dinner')],
           names=['sex', 'time'])

In [172]:
df.groupby(['sex','time']).mean().reset_index()

C:\Users\starl\AppData\Local\Temp\ipykernel_11724\3801897620.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['sex','time']).mean().reset_index()

      sex    time  total_bill       tip      size
0    Male   Lunch   28.440000  2.560000  2.000000
1    Male  Dinner   18.616667  2.928333  2.666667
2  Female   Lunch   12.740000  2.260000  2.000000
3  Female  Dinner   15.380000  3.000000  2.000000

In [173]:
df.groupby(['sex','time'], as_index=False).mean()

C:\Users\starl\AppData\Local\Temp\ipykernel_11724\54886949.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['sex','time'], as_index=False).mean()

      sex    time  total_bill       tip      size
0    Male   Lunch   28.440000  2.560000  2.000000
1    Male  Dinner   18.616667  2.928333  2.666667
2  Female   Lunch   12.740000  2.260000  2.000000
3  Female  Dinner   15.380000  3.000000  2.000000

In [174]:
import datetime

In [175]:
print(datetime.datetime.now())

2023-12-17 16:00:22.809493

In [176]:
print(datetime.datetime.today())

2023-12-17 16:00:43.593591

In [177]:
a = datetime.datetime(1970, 1, 1)
b = datetime.datetime(2023, 12, 19, 6, 14, 14)

In [178]:
print(a)

1970-01-01 00:00:00

In [179]:
print(b)

2023-12-19 06:14:14

In [180]:
print(a - b)

-19711 days, 17:45:46

In [181]:
print(type(a -  b))

<class 'datetime.timedelta'>

In [182]:
df = pd.read_csv('../data/country_timeseries.csv')

In [183]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    object
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
dtypes: float64(16), int64(1), object(1)
memory usage: 17.3+ KB

In [184]:
df['Date'] = pd.to_datetime(df['Date'])

In [185]:
df

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,2015-01-05,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,2015-01-04,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,2015-01-03,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,2015-01-02,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,2014-12-31,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
117,2014-03-27,5,103.0,8.0,6.0,NaN,NaN,NaN,NaN,NaN,66.0,6.0,5.0,NaN,NaN,NaN,NaN,NaN
118,2014-03-26,4,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,62.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119,2014-03-25,3,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,60.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
120,2014-03-24,2,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,59.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
121,2014-03-22,0,49.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,29.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [186]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    datetime64[ns]
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
dtypes: datetime64[ns](1), float64(16), int64(1)
memory usage: 17.3 KB

In [187]:
df = pd.DataFrame({
    'data' : ['01/01/15','02/01/15', '03/01/15']
})

In [188]:
df

       data
0  01/01/15
1  02/01/15
2  03/01/15

In [190]:
df['date1'] = pd.to_datetime(df['data'], format='%d/%m/%y')

In [191]:
df

       data      date1
0  01/01/15 2015-01-01
1  02/01/15 2015-01-02
2  03/01/15 2015-01-03

In [193]:
df['date2'] = pd.to_datetime(df['data'], format='%m/%d/%y')
df['date3'] = pd.to_datetime(df['data'], format='%y/%m/%d')

In [194]:
df

       data      date1      date2      date3
0  01/01/15 2015-01-01 2015-01-01 2001-01-15
1  02/01/15 2015-01-02 2015-02-01 2002-01-15
2  03/01/15 2015-01-03 2015-03-01 2003-01-15

In [195]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   data    3 non-null      object
 1   date1   3 non-null      datetime64[ns]
 2   date2   3 non-null      datetime64[ns]
 3   date3   3 non-null      datetime64[ns]
dtypes: datetime64[ns](3), object(1)
memory usage: 228.0+ bytes

In [196]:
now = datetime.datetime.now(
)

In [197]:
print(now)

2023-12-17 16:19:47.346087

In [198]:
print(now.strftime('%y-%m-%d'))

23-12-17

In [199]:
print(now.strftime('%H:%M:%S'))

16:19:47

In [200]:
print(now.strftime('%y-%m-%d, %H:%M:%S'))

23-12-17, 16:19:47

In [201]:
df = pd.read_csv('../data/country_timeseries.csv', parse_dates=[0])

In [202]:
df

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,2015-01-05,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,2015-01-04,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,2015-01-03,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,2015-01-02,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,2014-12-31,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
117,2014-03-27,5,103.0,8.0,6.0,NaN,NaN,NaN,NaN,NaN,66.0,6.0,5.0,NaN,NaN,NaN,NaN,NaN
118,2014-03-26,4,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,62.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119,2014-03-25,3,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,60.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
120,2014-03-24,2,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,59.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
121,2014-03-22,0,49.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,29.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [203]:
s = pd.Series(['2018-05-16','2018-05-17','2018-05-18'])

In [204]:
s

0    2018-05-16
1    2018-05-17
2    2018-05-18
dtype: object

In [205]:
d = pd.to_datetime(s)

In [206]:
d

0   2018-05-16
1   2018-05-17
2   2018-05-18
dtype: datetime64[ns]

In [208]:
d.dt.year

0    2018
1    2018
2    2018
dtype: int64

In [209]:
d.dt.month

0    5
1    5
2    5
dtype: int64

In [210]:
d.dt.day

0    16
1    17
2    18
dtype: int64

In [211]:
d[0].year

2018

In [212]:
d[0].month

5

In [213]:
d[0].day

16

In [214]:
df = pd.read_csv('../data/country_timeseries.csv', parse_dates=[0])

In [215]:
df

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,2015-01-05,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,2015-01-04,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,2015-01-03,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,2015-01-02,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,2014-12-31,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
117,2014-03-27,5,103.0,8.0,6.0,NaN,NaN,NaN,NaN,NaN,66.0,6.0,5.0,NaN,NaN,NaN,NaN,NaN
118,2014-03-26,4,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,62.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119,2014-03-25,3,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,60.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
120,2014-03-24,2,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,59.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
121,2014-03-22,0,49.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,29.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [216]:
df['year'], df['month'] = df['Date'].dt.year, df['Date'].dt.month

In [217]:
df

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali,year,month
0,2015-01-05,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN,2015,1
1,2015-01-04,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN,2015,1
2,2015-01-03,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN,2015,1
3,2015-01-02,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN,2015,1
4,2014-12-31,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN,2014,12
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
117,2014-03-27,5,103.0,8.0,6.0,NaN,NaN,NaN,NaN,NaN,66.0,6.0,5.0,NaN,NaN,NaN,NaN,NaN,2014,3
118,2014-03-26,4,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,62.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2014,3
119,2014-03-25,3,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,60.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2014,3
120,2014-03-24,2,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,59.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2014,3
121,2014-03-22,0,49.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,29.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2014,3

In [218]:
df[['Date','year','month']]

          Date  year  month
0   2015-01-05  2015      1
1   2015-01-04  2015      1
2   2015-01-03  2015      1
3   2015-01-02  2015      1
4   2014-12-31  2014     12
..         ...   ...    ...
117 2014-03-27  2014      3
118 2014-03-26  2014      3
119 2014-03-25  2014      3
120 2014-03-24  2014      3
121 2014-03-22  2014      3

[122 rows x 3 columns]

In [219]:
df['day'] = df['Date'].dt.day

In [220]:
df[['Date','year','month','day']]

          Date  year  month  day
0   2015-01-05  2015      1    5
1   2015-01-04  2015      1    4
2   2015-01-03  2015      1    3
3   2015-01-02  2015      1    2
4   2014-12-31  2014     12   31
..         ...   ...    ...  ...
117 2014-03-27  2014      3   27
118 2014-03-26  2014      3   26
119 2014-03-25  2014      3   25
120 2014-03-24  2014      3   24
121 2014-03-22  2014      3   22

[122 rows x 4 columns]

In [221]:
df = pd.read_csv('../data/country_timeseries.csv', parse_dates=[0])

In [222]:
df

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
0,2015-01-05,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
1,2015-01-04,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2,2015-01-03,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
3,2015-01-02,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
4,2014-12-31,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
117,2014-03-27,5,103.0,8.0,6.0,NaN,NaN,NaN,NaN,NaN,66.0,6.0,5.0,NaN,NaN,NaN,NaN,NaN
118,2014-03-26,4,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,62.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119,2014-03-25,3,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,60.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
120,2014-03-24,2,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,59.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
121,2014-03-22,0,49.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,29.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [223]:
df.index = df['Date']

In [224]:
df

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali
Date,,,,,,,,,,,,,,,,,,
2015-01-05,2015-01-05,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN
2015-01-04,2015-01-04,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN
2015-01-03,2015-01-03,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN
2015-01-02,2015-01-02,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN
2014-12-31,2014-12-31,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2014-03-27,2014-03-27,5,103.0,8.0,6.0,NaN,NaN,NaN,NaN,NaN,66.0,6.0,5.0,NaN,NaN,NaN,NaN,NaN
2014-03-26,2014-03-26,4,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,62.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2014-03-25,2014-03-25,3,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,60.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2014-03-24,2014-03-24,2,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,59.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2014-03-22,2014-03-22,0,49.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,29.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [225]:
df.index.min()

Timestamp('2014-03-22 00:00:00')

In [226]:
df['outbreak_d'] = df['Date'] - df.index.min()

In [227]:
df

,Date,Day,Cases_Guinea,Cases_Liberia,Cases_SierraLeone,Cases_Nigeria,Cases_Senegal,Cases_UnitedStates,Cases_Spain,Cases_Mali,Deaths_Guinea,Deaths_Liberia,Deaths_SierraLeone,Deaths_Nigeria,Deaths_Senegal,Deaths_UnitedStates,Deaths_Spain,Deaths_Mali,outbreak_d
Date,,,,,,,,,,,,,,,,,,,
2015-01-05,2015-01-05,289,2776.0,NaN,10030.0,NaN,NaN,NaN,NaN,NaN,1786.0,NaN,2977.0,NaN,NaN,NaN,NaN,NaN,289 days
2015-01-04,2015-01-04,288,2775.0,NaN,9780.0,NaN,NaN,NaN,NaN,NaN,1781.0,NaN,2943.0,NaN,NaN,NaN,NaN,NaN,288 days
2015-01-03,2015-01-03,287,2769.0,8166.0,9722.0,NaN,NaN,NaN,NaN,NaN,1767.0,3496.0,2915.0,NaN,NaN,NaN,NaN,NaN,287 days
2015-01-02,2015-01-02,286,NaN,8157.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3496.0,NaN,NaN,NaN,NaN,NaN,NaN,286 days
2014-12-31,2014-12-31,284,2730.0,8115.0,9633.0,NaN,NaN,NaN,NaN,NaN,1739.0,3471.0,2827.0,NaN,NaN,NaN,NaN,NaN,284 days
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2014-03-27,2014-03-27,5,103.0,8.0,6.0,NaN,NaN,NaN,NaN,NaN,66.0,6.0,5.0,NaN,NaN,NaN,NaN,NaN,5 days
2014-03-26,2014-03-26,4,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,62.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4 days
2014-03-25,2014-03-25,3,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,60.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3 days
2014-03-24,2014-03-24,2,86.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,59.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2 days
2014-03-22,2014-03-22,0,49.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,29.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0 days

In [228]:
df[['Date','outbreak_d']]

                 Date outbreak_d
Date
2015-01-05 2015-01-05   289 days
2015-01-04 2015-01-04   288 days
2015-01-03 2015-01-03   287 days
2015-01-02 2015-01-02   286 days
2014-12-31 2014-12-31   284 days
...               ...        ...
2014-03-27 2014-03-27     5 days
2014-03-26 2014-03-26     4 days
2014-03-25 2014-03-25     3 days
2014-03-24 2014-03-24     2 days
2014-03-22 2014-03-22     0 days

[122 rows x 2 columns]

In [231]:
df = pd.read_csv('../data/banklist.csv', parse_dates=[5,6])

In [232]:
df

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,2017-12-15,2017-12-20
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,2017-10-13,2017-10-20
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",2017-05-26,2017-07-26
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,2017-05-05,2017-07-26
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,2017-04-28,2017-12-05
...,...,...,...,...,...,...,...
550,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",2001-07-27,2014-08-19
551,Malta National Bank,Malta,OH,6629,North Valley Bank,2001-05-03,2002-11-18
552,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2001-02-02,2003-02-18
553,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,2000-12-14,2005-03-17
554,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,2000-10-13,2005-03-17

In [234]:
df['cyear'], df['cquarter'] = df['Closing Date'].dt.year, df['Closing Date'].dt.quarter

In [235]:
df

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date,cyear,cquarter
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,2017-12-15,2017-12-20,2017,4
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,2017-10-13,2017-10-20,2017,4
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",2017-05-26,2017-07-26,2017,2
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,2017-05-05,2017-07-26,2017,2
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,2017-04-28,2017-12-05,2017,2
...,...,...,...,...,...,...,...,...,...
550,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",2001-07-27,2014-08-19,2001,3
551,Malta National Bank,Malta,OH,6629,North Valley Bank,2001-05-03,2002-11-18,2001,2
552,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2001-02-02,2003-02-18,2001,1
553,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,2000-12-14,2005-03-17,2000,4
554,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,2000-10-13,2005-03-17,2000,4

In [236]:
df.groupby('cyear').size

In [238]:
df.groupby('cyear').size()

cyear
2000      2
2001      4
2002     11
2003      3
2004      4
2007      3
2008     25
2009    140
2010    157
2011     92
2012     51
2013     24
2014     18
2015      8
2016      5
2017      8
dtype: int64

In [239]:
df.groupby(['cyear', 'cquarter']).size()

cyear  cquarter
2000   4            2
2001   1            1
       2            1
       3            2
2002   1            6
       2            2
       3            1
       4            2
2003   1            1
       2            1
       4            1
2004   1            3
       2            1
2007   1            1
       3            1
       4            1
2008   1            2
       2            2
       3            9
       4           12
2009   1           21
       2           24
       3           50
       4           45
2010   1           41
       2           45
       3           41
       4           30
2011   1           26
       2           22
       3           26
       4           18
2012   1           16
       2           15
       3           12
       4            8
2013   1            4
       2           12
       3            6
       4            2
2014   1            5
       2            7
       3            2
       4            4
2015   1            4
       2            1
       3            1
       4            2
2016   1            1
       2            2
       3            2
2017   1            3
       2            3
       4            2
dtype: int64